GatePay/loadtest/gd4/evidence/gd4-validation-20260811-235710/gd4-validation-console.log

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/paygate/webhook-validation-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * gd4_validation_nonmatching_content: 30 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 1378 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [   2% ] 30 VUs  0m01.0s/1m0s

running (0m02.0s), 30/30 VUs, 2857 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [   3% ] 30 VUs  0m02.0s/1m0s

running (0m03.0s), 30/30 VUs, 4458 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [   5% ] 30 VUs  0m03.0s/1m0s

running (0m04.0s), 30/30 VUs, 6293 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [   7% ] 30 VUs  0m04.0s/1m0s

running (0m05.0s), 30/30 VUs, 8318 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [   8% ] 30 VUs  0m05.0s/1m0s

running (0m06.0s), 30/30 VUs, 10362 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  10% ] 30 VUs  0m06.0s/1m0s

running (0m07.0s), 30/30 VUs, 12014 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  12% ] 30 VUs  0m07.0s/1m0s

running (0m08.0s), 30/30 VUs, 14043 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  13% ] 30 VUs  0m08.0s/1m0s

running (0m09.0s), 30/30 VUs, 15908 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  15% ] 30 VUs  0m09.0s/1m0s

running (0m10.0s), 30/30 VUs, 17808 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  17% ] 30 VUs  0m10.0s/1m0s

running (0m11.0s), 30/30 VUs, 19490 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  18% ] 30 VUs  0m11.0s/1m0s

running (0m12.0s), 30/30 VUs, 21552 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  20% ] 30 VUs  0m12.0s/1m0s

running (0m13.0s), 30/30 VUs, 23629 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  22% ] 30 VUs  0m13.0s/1m0s

running (0m14.0s), 30/30 VUs, 25518 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  23% ] 30 VUs  0m14.0s/1m0s

running (0m15.0s), 30/30 VUs, 27531 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  25% ] 30 VUs  0m15.0s/1m0s

running (0m16.0s), 30/30 VUs, 29536 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  27% ] 30 VUs  0m16.0s/1m0s

running (0m17.0s), 30/30 VUs, 31263 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  28% ] 30 VUs  0m17.0s/1m0s

running (0m18.0s), 30/30 VUs, 33285 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  30% ] 30 VUs  0m18.0s/1m0s

running (0m19.0s), 30/30 VUs, 35377 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  32% ] 30 VUs  0m19.0s/1m0s

running (0m20.0s), 30/30 VUs, 37445 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  33% ] 30 VUs  0m20.0s/1m0s

running (0m21.0s), 30/30 VUs, 39530 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  35% ] 30 VUs  0m21.0s/1m0s

running (0m22.0s), 30/30 VUs, 41235 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  37% ] 30 VUs  0m22.0s/1m0s

running (0m23.0s), 30/30 VUs, 43082 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  38% ] 30 VUs  0m23.0s/1m0s

running (0m24.0s), 30/30 VUs, 44948 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  40% ] 30 VUs  0m24.0s/1m0s

running (0m25.0s), 30/30 VUs, 47012 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  42% ] 30 VUs  0m25.0s/1m0s

running (0m26.0s), 30/30 VUs, 49016 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  43% ] 30 VUs  0m26.0s/1m0s

running (0m27.0s), 30/30 VUs, 50708 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  45% ] 30 VUs  0m27.0s/1m0s

running (0m28.0s), 30/30 VUs, 52715 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  47% ] 30 VUs  0m28.0s/1m0s

running (0m29.0s), 30/30 VUs, 54801 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  48% ] 30 VUs  0m29.0s/1m0s

running (0m30.0s), 30/30 VUs, 56888 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  50% ] 30 VUs  0m30.0s/1m0s

running (0m31.0s), 30/30 VUs, 58918 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  52% ] 30 VUs  0m31.0s/1m0s

running (0m32.0s), 30/30 VUs, 61024 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  53% ] 30 VUs  0m32.0s/1m0s

running (0m33.0s), 30/30 VUs, 63000 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  55% ] 30 VUs  0m33.0s/1m0s

running (0m34.0s), 30/30 VUs, 64666 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  57% ] 30 VUs  0m34.0s/1m0s

running (0m35.0s), 30/30 VUs, 66732 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  58% ] 30 VUs  0m35.0s/1m0s

running (0m36.0s), 30/30 VUs, 68763 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  60% ] 30 VUs  0m36.0s/1m0s

running (0m37.0s), 30/30 VUs, 70530 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  62% ] 30 VUs  0m37.0s/1m0s

running (0m38.0s), 30/30 VUs, 72518 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  63% ] 30 VUs  0m38.0s/1m0s

running (0m39.0s), 30/30 VUs, 74564 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  65% ] 30 VUs  0m39.0s/1m0s

running (0m40.0s), 30/30 VUs, 76650 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  67% ] 30 VUs  0m40.0s/1m0s

running (0m41.0s), 30/30 VUs, 78702 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  68% ] 30 VUs  0m41.0s/1m0s

running (0m42.0s), 30/30 VUs, 80809 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  70% ] 30 VUs  0m42.0s/1m0s

running (0m43.0s), 30/30 VUs, 82898 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  72% ] 30 VUs  0m43.0s/1m0s

running (0m44.0s), 30/30 VUs, 84802 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  73% ] 30 VUs  0m44.0s/1m0s

running (0m45.0s), 30/30 VUs, 86560 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  75% ] 30 VUs  0m45.0s/1m0s

running (0m46.0s), 30/30 VUs, 88551 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  77% ] 30 VUs  0m46.0s/1m0s

running (0m47.0s), 30/30 VUs, 90292 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  78% ] 30 VUs  0m47.0s/1m0s

running (0m48.0s), 30/30 VUs, 92325 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  80% ] 30 VUs  0m48.0s/1m0s

running (0m49.0s), 30/30 VUs, 94400 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  82% ] 30 VUs  0m49.0s/1m0s

running (0m50.0s), 30/30 VUs, 96495 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  83% ] 30 VUs  0m50.0s/1m0s

running (0m51.0s), 30/30 VUs, 98595 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  85% ] 30 VUs  0m51.0s/1m0s

running (0m52.0s), 30/30 VUs, 100676 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  87% ] 30 VUs  0m52.0s/1m0s

running (0m53.0s), 30/30 VUs, 102792 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  88% ] 30 VUs  0m53.0s/1m0s

running (0m54.0s), 30/30 VUs, 104748 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  90% ] 30 VUs  0m54.0s/1m0s

running (0m55.0s), 30/30 VUs, 106835 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  92% ] 30 VUs  0m55.0s/1m0s

running (0m56.0s), 30/30 VUs, 108638 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  93% ] 30 VUs  0m56.0s/1m0s

running (0m57.0s), 30/30 VUs, 110175 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  95% ] 30 VUs  0m57.0s/1m0s

running (0m58.0s), 30/30 VUs, 112224 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  97% ] 30 VUs  0m58.0s/1m0s

running (0m59.0s), 30/30 VUs, 114332 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [  98% ] 30 VUs  0m59.0s/1m0s

running (1m00.0s), 30/30 VUs, 116455 complete and 0 interrupted iterations
gd4_validation_nonmatching_...   [ 100% ] 30 VUs  1m00.0s/1m0s


  Γûê THRESHOLDS 

    checks
    Γ£ô 'rate==1' rate=100.00%

    gd4_validation_duration
    Γ£ô 'p(95)<1000' p(95)=20.7863


  Γûê TOTAL RESULTS 

    checks_total.......: 349497  5823.803322/s
    checks_succeeded...: 100.00% 349497 out of 349497
    checks_failed......: 0.00%   0 out of 349497

    Γ£ô non-matching transfer content returns HTTP 404
    Γ£ô valid HMAC is not rejected as HTTP 401
    Γ£ô server returns an HTTP response

    CUSTOM
    gd4_validation_duration........: avg=15.150811 min=7.9411 med=14.5642 max=92.9237  p(90)=18.82416 p(95)=20.7863
    gd4_validation_rejected_404....: 116499 1941.267774/s
    gd4_validation_requests........: 116499 1941.267774/s

    HTTP
    http_req_duration..............: avg=15.15ms   min=7.94ms med=14.56ms max=92.92ms  p(90)=18.82ms  p(95)=20.78ms
      { expected_response:true }...: avg=15.15ms   min=7.94ms med=14.56ms max=92.92ms  p(90)=18.82ms  p(95)=20.78ms
    http_req_failed................: 0.00%  0 out of 116499
    http_reqs......................: 116499 1941.267774/s

    EXECUTION
    iteration_duration.............: avg=15.43ms   min=8.08ms med=14.84ms max=107.83ms p(90)=19.1ms   p(95)=21.09ms
    iterations.....................: 116499 1941.267774/s
    vus............................: 30     min=30          max=30
    vus_max........................: 30     min=30          max=30

    NETWORK
    data_received..................: 66 MB  1.1 MB/s
    data_sent......................: 60 MB  1.0 MB/s



running (1m00.0s), 00/30 VUs, 116499 complete and 0 interrupted iterations
gd4_validation_nonmatching_... Γ£ô [ 100% ] 30 VUs  1m0s